test/test_msp_cfdem_solver_piso/CFD/constant/couplingProperties
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
  version         2.0;
  format          ascii;
  root            "";
  case            "";
  instance        "";
  local           "";
  class           dictionary;
  object          couplingProperties;
}

/* ---------------------------- sub-models & settings ---------------------------- */

modelType B; // A or B

couplingInterval 100;

expandedCellScale 6;

allowUseSubCFDTimeStep false;

globalForce globalForce;

useGuoBBOEquation false;

forceModels
(
  Archimedes
  // dragForce
);

momCoupleModels
(
  implicitCouple
);

voidFractionModel divided;

locateModel engine;

meshMotionModel noMeshMotion;

dataExchangeModel twoWayMPI;

averagingModel dense;

turbulenceModelType turbulenceProperties;

/* ---------------------------- sub-model properties ------------------------- */

implicitCoupleProps
{
  velFieldName "U";
  granVelFieldName "Us";
  voidFractionFieldName "voidFraction";
}

"(globalForceProps|mixGlobalForceProps)"
{
  velFieldName "U";
  voidFractionFieldName "voidFraction";
  gravityFieldName "g";
}

ArchimedesProps
{
  treatForceExplicitInMomEquation false;
  treatForceBothCFDAndDEM true;
  treatDEMForceImplicit false;
  verbose true;
  interpolation false;
}

dragForceProps
{
  dragModelName "DiFelice";
  treatForceExplicitInMomEquation false;
  treatForceBothCFDAndDEM true;
  treatDEMForceImplicit false;
  verbose true;
  interpolation false;
}

virtualMassForceProps
{
  treatForceExplicitInMomEquation false;
  treatForceBothCFDAndDEM true;
  treatDEMForceImplicit false;
  verbose true;
  interpolation false;
  scalarViscosity false;
}

twoWayMPIProps
{
  liggghtsPath "../DEM/in.liggghts_run";
}

dividedProps
{
  alphaMin 0.3;
  scaleUpVol 1.0;
}

engineProps
{
  verbose true;
  treeSearch true;
}
